app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "illu min a ti"], ["user_id", 5], ["created_at", "2016-03-08 17:59:15.382142"], ["updated_at", "2016-03-08 17:59:15.382142"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)